Openfoam/twophase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    topWall
    {
        type            noSlip;
    }

    botWall
    {
        type            noSlip;
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }


    fixWall
    {
        type            empty;
    }


}


// ************************************************************************* //
