Openfoam/twophase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 1e-20;

boundaryField
{

    topWall
    {
        type            epsilonWallFunction;
        value           uniform 1e-20;
    }

    botWall
    {
        type            epsilonWallFunction;
        value           uniform 1e-20;
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }



    fixWall
    {
        type            empty;
    }


}


// ************************************************************************* //
