Openfoam/twophase/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* turbulenceDamping
{
    type            turbulenceDamping;
    active          false;
    turbulenceDampingCoeffs
    {
        fields      (omega);
        B           2;
        dampingTreatment heavyNegative;
        lengthScale FA;
        explicitSourceTreatment true;
    }
} */




// ************************************************************************* //
