Openfoam/twophase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |

   OpenFOAM for Windows 20.09 (v1)
   Built by CFD Support, www.cfdsupport.com (based on Symscape).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       1792;
    }
    botWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8;
        startFace       1800;
    }
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          120;
        startFace       1808;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-0.4 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          120;
        startFace       1928;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (0.4 0 0);
    }
    fixWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1920;
        startFace       2048;
    }
)

// ************************************************************************* //
