Openfoam/twophase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
} 

gradSchemes
{
    default         Gauss linear;
}

divSchemes 
{
    div(rhoPhi,U) Gauss limitedLinear 1; 
    div(phi,alpha) Gauss vanLeer; 
    div(phirb,alpha) Gauss interfaceCompression;
    "div\(phi,(k|omega|epsilon)\)"      Gauss vanLeer;
    "div\(rhoPhi,(k|omega|epsilon)\)"      Gauss vanLeer;  
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

wallDist
{
    method meshWave;
}



// ************************************************************************* //
